In [187]:
import pandas as pd
import numpy as np
import random
numbers = np.random.randn(5)
s = pd.Series(numbers)
s

0    0.525907
1    0.116150
2   -0.715782
3   -1.313914
4    1.267269
dtype: float64

In [3]:
s

0    0.987032
1    1.089186
2    0.297627
3    0.560558
4   -0.412397
dtype: float64

In [10]:
idx = ['a','b','c','d','e']
s = pd.Series(numbers, index = idx)
s

a    0.987032
b    1.089186
c    0.297627
d    0.560558
e   -0.412397
dtype: float64

In [6]:
s[0]

0.9870320346119839

In [7]:
s['a']

0.9870320346119839

In [8]:
s[1:3]

b    1.089186
c    0.297627
dtype: float64

In [11]:
s = pd.Series([2,3,5,7,11])
s[0]

2

In [12]:
s[1:3]

1    3
2    5
dtype: int64

In [14]:
s[0:1]

0    2
dtype: int64

In [15]:
s

0     2
1     3
2     5
3     7
4    11
dtype: int64

In [16]:
s[-1]

KeyError: -1

In [17]:
s = pd.Series(['dog','goat','skunk'])
s

0      dog
1     goat
2    skunk
dtype: object

In [18]:
s.map(lambda s:len(s))

0    3
1    4
2    5
dtype: int64

In [52]:
d = {'A':pd.Series([1,2,3], index=['cat', 'dog', 'bird']),
    'B':{'cat':3.14, 'dog':2.718, 'bird':1.618, 'goat':0.5772}}
df = pd.DataFrame(d)
df

        A       B
bird  3.0  1.6180
cat   1.0  3.1400
dog   2.0  2.7180
goat  NaN  0.5772

In [53]:
d = {'PhD' : {'Wilson':'Jogns Hopskins'},
    'JD' : {'Ford':'Yale', 'Obama':'Harvard'},
    'Terms': pd.Series([1,1,2,2], index = ['Ford','Hoover','Wilson','Obama']),
    'Undergrad' : pd.Series(['Umich', 'Stanford', 'Princeton', 'Columbia'],
                            index=['Ford','Hoover','Wilson','Obama'])}
presidents = pd.DataFrame(d)
presidents

                   PhD       JD  Terms  Undergrad
Ford               NaN     Yale      1      Umich
Hoover             NaN      NaN      1   Stanford
Obama              NaN  Harvard      2   Columbia
Wilson  Jogns Hopskins      NaN      2  Princeton

In [54]:
presidents.columns

Index(['PhD', 'JD', 'Terms', 'Undergrad'], dtype='object')

In [55]:
presidents.index

Index(['Ford', 'Hoover', 'Obama', 'Wilson'], dtype='object')

In [56]:
presidents['PhD']

Ford                 NaN
Hoover               NaN
Obama                NaN
Wilson    Jogns Hopskins
Name: PhD, dtype: object

In [57]:
presidents['Years'] = 4*presidents['Terms']
presidents

                   PhD       JD  Terms  Undergrad  Years
Ford               NaN     Yale      1      Umich      4
Hoover             NaN      NaN      1   Stanford      4
Obama              NaN  Harvard      2   Columbia      8
Wilson  Jogns Hopskins      NaN      2  Princeton      8

In [58]:
type(presidents['PhD'])

pandas.core.series.Series

In [59]:
presidents['Nobels'] = [0,0,1,1]
presidents

                   PhD       JD  Terms  Undergrad  Years  Nobels
Ford               NaN     Yale      1      Umich      4       0
Hoover             NaN      NaN      1   Stanford      4       0
Obama              NaN  Harvard      2   Columbia      8       1
Wilson  Jogns Hopskins      NaN      2  Princeton      8       1

In [60]:
presidents['Fields Medals'] = 0
presidents

,PhD,JD,Terms,Undergrad,Years,Nobels,Fields Medals
Ford,NaN,Yale,1,Umich,4,0,0
Hoover,NaN,NaN,1,Stanford,4,0,0
Obama,NaN,Harvard,2,Columbia,8,1,0
Wilson,Jogns Hopskins,NaN,2,Princeton,8,1,0

In [61]:
del presidents['Years']
presidents

                   PhD       JD  Terms  Undergrad  Nobels  Fields Medals
Ford               NaN     Yale      1      Umich       0              0
Hoover             NaN      NaN      1   Stanford       0              0
Obama              NaN  Harvard      2   Columbia       1              0
Wilson  Jogns Hopskins      NaN      2  Princeton       1              0

In [62]:
fields = presidents.pop('Fields Medals')

In [63]:
presidents

                   PhD       JD  Terms  Undergrad  Nobels
Ford               NaN     Yale      1      Umich       0
Hoover             NaN      NaN      1   Stanford       0
Obama              NaN  Harvard      2   Columbia       1
Wilson  Jogns Hopskins      NaN      2  Princeton       1

In [64]:
fields

Ford      0
Hoover    0
Obama     0
Wilson    0
Name: Fields Medals, dtype: int64

In [65]:
presidents.loc['Obama']

PhD               NaN
JD            Harvard
Terms               2
Undergrad    Columbia
Nobels              1
Name: Obama, dtype: object

In [66]:
presidents.iloc[1]

PhD               NaN
JD                NaN
Terms               1
Undergrad    Stanford
Nobels              0
Name: Hoover, dtype: object

In [67]:
presidents['JD']

Ford         Yale
Hoover        NaN
Obama     Harvard
Wilson        NaN
Name: JD, dtype: object

In [68]:
presidents[1:3]

        PhD       JD  Terms Undergrad  Nobels
Hoover  NaN      NaN      1  Stanford       0
Obama   NaN  Harvard      2  Columbia       1

In [69]:
presidents[presidents['Terms']<2]

        PhD    JD  Terms Undergrad  Nobels
Ford    NaN  Yale      1     Umich       0
Hoover  NaN   NaN      1  Stanford       0

In [70]:
df1 = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])
df1+df2

          A         B         C   D
0  0.872919 -0.334138  1.812921 NaN
1 -0.998368 -1.895460  1.193890 NaN
2 -0.562908  2.018404  1.118062 NaN
3 -0.868227  2.034831  1.949838 NaN
4  0.211338  0.224241  0.959625 NaN
5       NaN       NaN       NaN NaN
6       NaN       NaN       NaN NaN
7       NaN       NaN       NaN NaN

In [71]:
df = pd.DataFrame(np.random.randn(4, 2), columns=['A', 'B'])
df

          A         B
0 -0.027852  0.499036
1  1.017810 -0.761093
2 -0.459756  0.128241
3  0.084639  0.997586

In [72]:
df - df.iloc[0]

          A         B
0  0.000000  0.000000
1  1.045662 -1.260129
2 -0.431904 -0.370796
3  0.112491  0.498549

In [73]:
df

          A         B
0 -0.027852  0.499036
1  1.017810 -0.761093
2 -0.459756  0.128241
3  0.084639  0.997586

In [74]:
(df > 0).any()

A    True
B    True
dtype: bool

In [75]:
(df > 0).all()

A    False
B    False
dtype: bool

In [76]:
df

          A         B
0 -0.027852  0.499036
1  1.017810 -0.761093
2 -0.459756  0.128241
3  0.084639  0.997586

In [77]:
df.T*df.T

          0         1         2         3
A  0.000776  1.035937  0.211376  0.007164
B  0.249037  0.579262  0.016446  0.995177

In [78]:
df.T.dot(df)

          A         B
A  1.255252 -0.763072
B -0.763072  1.839922

In [79]:
df

          A         B
0 -0.027852  0.499036
1  1.017810 -0.761093
2 -0.459756  0.128241
3  0.084639  0.997586

In [80]:
df.mean()

A    0.153710
B    0.215942
dtype: float64

In [81]:
df.mean(1)

0    0.235592
1    0.128358
2   -0.165758
3    0.541112
dtype: float64

In [83]:
ff = pd.read_csv("forestfires.csv")
ff

     X  Y month  day  FFMC    DMC     DC   ISI  temp  RH  wind  rain   area
0    7  5   mar  fri  86.2   26.2   94.3   5.1   8.2  51   6.7   0.0   0.00
1    7  4   oct  tue  90.6   35.4  669.1   6.7  18.0  33   0.9   0.0   0.00
2    7  4   oct  sat  90.6   43.7  686.9   6.7  14.6  33   1.3   0.0   0.00
3    8  6   mar  fri  91.7   33.3   77.5   9.0   8.3  97   4.0   0.2   0.00
4    8  6   mar  sun  89.3   51.3  102.2   9.6  11.4  99   1.8   0.0   0.00
..  .. ..   ...  ...   ...    ...    ...   ...   ...  ..   ...   ...    ...
512  4  3   aug  sun  81.6   56.7  665.6   1.9  27.8  32   2.7   0.0   6.44
513  2  4   aug  sun  81.6   56.7  665.6   1.9  21.9  71   5.8   0.0  54.29
514  7  4   aug  sun  81.6   56.7  665.6   1.9  21.2  70   6.7   0.0  11.16
515  1  4   aug  sat  94.4  146.0  614.7  11.3  25.6  42   4.0   0.0   0.00
516  6  3   nov  tue  79.5    3.0  106.7   1.1  11.8  31   4.5   0.0   0.00

[517 rows x 13 columns]

In [93]:
ff['rain'].mean()

0.021663442940038684

In [109]:
is_windy = ff.wind > 6
is_windy

0       True
1      False
2      False
3      False
4      False
       ...
512    False
513    False
514     True
515    False
516    False
Name: wind, Length: 517, dtype: bool

In [110]:
ff.rain[is_windy].mean()

0.04126984126984126

In [122]:
ff[0:1]['rain']

0    0.0
Name: rain, dtype: float64

In [125]:
ff[0:1]['month']

0    mar
Name: month, dtype: object

In [138]:
get_month = (ff.month == 'mar')

In [137]:
get_month == 'mar'

0       True
1      False
2      False
3       True
4       True
       ...
512    False
513    False
514    False
515    False
516    False
Name: month, Length: 517, dtype: bool

In [140]:
get_month

0       True
1      False
2      False
3       True
4       True
       ...
512    False
513    False
514    False
515    False
516    False
Name: month, Length: 517, dtype: bool

In [141]:
ff.rain[get_month].sum()

0.2

In [142]:
df

          A         B
0 -0.027852  0.499036
1  1.017810 -0.761093
2 -0.459756  0.128241
3  0.084639  0.997586

In [143]:
df.describe()

              A         B
count  4.000000  4.000000
mean   0.153710  0.215942
std    0.622025  0.742383
min   -0.459756 -0.761093
25%   -0.135828 -0.094093
50%    0.028393  0.313639
75%    0.317932  0.623674
max    1.017810  0.997586

In [146]:
df.apply(np.mean)

A    0.153710
B    0.215942
dtype: float64

In [151]:
df.C

0    0.471184
1    0.256717
2   -0.331516
3    1.082224
dtype: float64

In [154]:
df.A

0   -0.027852
1    1.017810
2   -0.459756
3    0.084639
Name: A, dtype: float64

In [156]:
df.B

0    0.499036
1   -0.761093
2    0.128241
3    0.997586
Name: B, dtype: float64

In [160]:
df.D = 0

In [163]:
df = df1 + df2

In [165]:
df

          A         B         C   D
0  0.872919 -0.334138  1.812921 NaN
1 -0.998368 -1.895460  1.193890 NaN
2 -0.562908  2.018404  1.118062 NaN
3 -0.868227  2.034831  1.949838 NaN
4  0.211338  0.224241  0.959625 NaN
5       NaN       NaN       NaN NaN
6       NaN       NaN       NaN NaN
7       NaN       NaN       NaN NaN

In [166]:
df.C

0    1.812921
1    1.193890
2    1.118062
3    1.949838
4    0.959625
5         NaN
6         NaN
7         NaN
Name: C, dtype: float64

In [167]:
df.dropna(axis=1, how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [169]:
df.dropna(axis=1, how='all')

          A         B         C
0  0.872919 -0.334138  1.812921
1 -0.998368 -1.895460  1.193890
2 -0.562908  2.018404  1.118062
3 -0.868227  2.034831  1.949838
4  0.211338  0.224241  0.959625
5       NaN       NaN       NaN
6       NaN       NaN       NaN
7       NaN       NaN       NaN

In [170]:
df.drop([5,6,7])

          A         B         C   D
0  0.872919 -0.334138  1.812921 NaN
1 -0.998368 -1.895460  1.193890 NaN
2 -0.562908  2.018404  1.118062 NaN
3 -0.868227  2.034831  1.949838 NaN
4  0.211338  0.224241  0.959625 NaN

In [174]:
df = df.drop(['D'],axis=1)

In [175]:
df

          A         B         C
0  0.872919 -0.334138  1.812921
1 -0.998368 -1.895460  1.193890
2 -0.562908  2.018404  1.118062
3 -0.868227  2.034831  1.949838
4  0.211338  0.224241  0.959625
5       NaN       NaN       NaN
6       NaN       NaN       NaN
7       NaN       NaN       NaN

In [176]:
df = df.drop([5,6,7])

In [177]:
df

          A         B         C
0  0.872919 -0.334138  1.812921
1 -0.998368 -1.895460  1.193890
2 -0.562908  2.018404  1.118062
3 -0.868227  2.034831  1.949838
4  0.211338  0.224241  0.959625

In [178]:
def quadratic(x, a, b, c=1):
    return a*x**2 + b*x + c
df.apply(quadratic, args=(1,2), c=5)#a = 1, b =2

          A          B          C
0  7.507827   4.443373  11.912524
1  4.000003   4.801848   8.813151
2  4.191049  13.110761   8.486188
3  4.017364  13.210197  12.701547
4  5.467339   5.498766   7.840131

In [179]:
df = pd.DataFrame({'A': ['cat', 'dog', 'bird'],
                  'B': ['unicorn','chupacabra', 'pixie']})

In [180]:
df.apply(lambda s:s.upper())

AttributeError: 'Series' object has no attribute 'upper'

In [182]:
df.applymap(lambda s:s.upper())

      A           B
0   CAT     UNICORN
1   DOG  CHUPACABRA
2  BIRD       PIXIE

In [183]:
f = lambda x:x**2
g = lambda x:x+1
h = lambda x:2*x
df = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])
df

          A         B         C
0  0.645508  1.233403 -2.295670
1 -1.484427  0.213007  0.224163
2  2.223886  2.134870  1.116116
3 -0.549168  0.271286  0.442073
4  1.034864  0.040670 -0.825729

In [184]:
h(g(f(df)))

           A          B          C
0   2.833360   5.042565  12.540199
1   6.407049   2.090744   2.100498
2  11.891341  11.115338   4.491431
3   2.603171   2.147192   2.390857
4   4.141885   2.003308   3.363656

In [185]:
df.pipe(f).pipe(g).pipe(h)

           A          B          C
0   2.833360   5.042565  12.540199
1   6.407049   2.090744   2.100498
2  11.891341  11.115338   4.491431
3   2.603171   2.147192   2.390857
4   4.141885   2.003308   3.363656

In [189]:
s = pd.Series(np.random.randn(5), index = list('abcde'))
s

a    0.042855
b    0.246530
c   -0.468684
d    0.365826
e   -0.799636
dtype: float64